Repository: 4ieksander/taggyAI
Catalog: docs_sphinx/source/locales/*/LC_MESSAGES/modules.po
Languages: pl

source: Module that provides both synchronous functionality for:
pl: Moduł, który zapewnia zarówno synchroniczną funkcjonalność dla:

source: Tagging images using CLIP
pl: Oznaczanie obrazów za pomocą CLIP

source: Searching for images by similarity to a text query
pl: Wyszukiwanie obrazów na podstawie podobieństwa do zapytania tekstowego

source: Finding and grouping duplicate images by embedding similarity
pl: Znajdowanie i grupowanie zduplikowanych obrazów poprzez osadzanie podobieństwa

source: Proposing the best images in each group based on multiple metrics:
pl: Proponowanie najlepszych obrazów w każdej grupie na podstawie wielu wskaźników:

source: Naive "sharpness" via Laplacian
pl: Naiwna "ostrość" dzięki Laplacianowi

source: Face-detection-based sharpness
pl: Ostrość oparta na wykrywaniu twarzy

source: Optionally placing non-duplicates in a 'non_duplicates' folder
pl: Opcjonalne umieszczenie nieduplikatów w folderze "non_duplicates".

source: Saving grouping results to JSON
pl: Zapisywanie wyników grupowania w formacie JSON

source: Main entry point for the Taggy CLI.
pl: Główny punkt wejścia dla Taggy CLI.

source: Options
pl: Opcje

source: Path to the config file.
pl: Ścieżka do pliku konfiguracyjnego.

source: Finds and groups duplicate images based on their embedding similarity. Then organizes them into subfolders, picking 'best images' if desired.
pl: Znajduje i grupuje zduplikowane obrazy na podstawie ich podobieństwa osadzenia. Następnie organizuje je w podfoldery, wybierając w razie potrzeby "najlepsze obrazy".

source: **Required** Path to the folder containing images.
pl: **Wymagane** Ścieżka do folderu zawierającego obrazy.

source: Folder to place grouped duplicates.
pl: Folder do umieszczania zgrupowanych duplikatów.

source: List of labels used for grouping names of duplicates (if not provided, uses default).
pl: Lista etykiet używanych do grupowania nazw duplikatów (jeśli nie podano, używana jest wartość domyślna).

source: File operation(s) to perform when grouping duplicates.
pl: Operacje na plikach do wykonania podczas grupowania duplikatów.

source: options
pl: opcje

source: Threshold (0..1) for considering images duplicates.
pl: Próg (0..1) dla uznania obrazów za duplikaty.

source: Path to the Haar cascade XML file for face detection.
pl: Ścieżka do pliku XML kaskady Haara do wykrywania twarzy.

source: If provided, proposes 'best' images to keep in each group.
pl: Jeśli to możliwe, proponuje "najlepsze" obrazy do zachowania w każdej grupie.

source: How to score 'best' images.
pl: Jak oceniać "najlepsze" obrazy.

source: advanced | laplacian
pl: zaawansowany laplacian

source: Searches for images most similar to the provided text query using CLIP embeddings.
pl: Wyszukuje obrazy najbardziej podobne do podanego zapytania tekstowego przy użyciu osadzania CLIP.

source: **Required** Text query for searching similar images.
pl: **Wymagane** Zapytanie tekstowe do wyszukiwania podobnych obrazów.

source: Folder to place search results. Use if you want to do some operation on files what was found.
pl: Folder do umieszczenia wyników wyszukiwania. Użyj, jeśli chcesz wykonać jakąś operację na znalezionych plikach.

source: File operation to perform when searching images. Default is 'copy'
pl: Operacja na pliku do wykonania podczas wyszukiwania obrazów. Domyślnie jest to "kopiuj

source: Number of top results to return.
pl: Liczba najlepszych wyników do zwrócenia.

source: Assigns labels to each image in images_path using the CLIP model.
pl: Przypisuje etykiety do każdego obrazu w images_path przy użyciu modelu CLIP.

source: Minimum probability threshold for assigning a label.
pl: Minimalny próg prawdopodobieństwa przypisania etykiety.

source: Number of top tags to return.
pl: Liczba najlepszych tagów do zwrócenia.

source: List of labels used for tagging (if not provided, uses default).
pl: Lista etykiet używanych do tagowania (jeśli nie podano, używana jest wartość domyślna).

source: If provided, saves tags per every file to one provided JSON file.
pl: Jeśli podano, zapisuje tagi dla każdego pliku w jednym podanym pliku JSON.

source: File operation to perform. Grouped by detected labels, working with --output-folder parameter. Default is 'symlink'.
pl: Operacja na pliku do wykonania. Pogrupowane według wykrytych etykiet, działające z parametrem --output-folder. Domyślnie "symlink".

source: Folder to place tagged images. When you want to do some operation on files what was found.Graphics may be repeated (one image can be in many folders).
pl: Folder do umieszczania oznaczonych obrazów. Gdy chcesz wykonać jakąś operację na plikach, które zostały znalezione, grafika może się powtarzać (jeden obraz może znajdować się w wielu folderach).

source: If provided, saves tags per every file to separate JSON files.
pl: Jeśli podano, zapisuje tagi dla każdego pliku w oddzielnych plikach JSON.

source: Image Tagger – Taggy
pl: Tagger obrazów - Taggy

source: A class used to tag images, search for images by similarity, find and group duplicate images, and propose the best images in each group based on multiple metrics.
pl: Klasa używana do tagowania obrazów, wyszukiwania obrazów według podobieństwa, znajdowania i grupowania zduplikowanych obrazów oraz proponowania najlepszych obrazów w każdej grupie na podstawie wielu wskaźników.

source: The name of the model to load.
pl: Nazwa modelu do załadowania.

source: type
pl: typ

source: List of possible tags.
pl: Lista możliwych tagów.

source: The path to the Haar cascade file for face detection.
pl: Ścieżka do pliku kaskady Haara do wykrywania twarzy.

source: The device to run the model on (CPU or GPU).
pl: Urządzenie, na którym ma zostać uruchomiony model (CPU lub GPU).

source: The loaded CLIP model.
pl: Załadowany model CLIP.

source: The preprocessing function for the CLIP model.
pl: Funkcja przetwarzania wstępnego dla modelu CLIP.

source: callable
pl: wywoływalny

source: Computes a combined image quality score based on sharpness and face detection.
pl: Oblicza łączny wynik jakości obrazu na podstawie ostrości i wykrywania twarzy.

source: This method calculates the sharpness of the entire image using the variance of the Laplacian. If a Haar cascade file for face detection is available, it also calculates the sharpness of detected faces and combines these scores to produce a final quality score.
pl: Metoda ta oblicza ostrość całego obrazu przy użyciu wariancji Laplaciana. Jeśli dostępny jest plik kaskady Haara do wykrywania twarzy, oblicza on również ostrość wykrytych twarzy i łączy te wyniki, aby uzyskać ostateczny wynik jakości.

source: Grayscale image array.
pl: Tablica obrazów w skali szarości.

source: Combined image quality score.
pl: Łączny wynik jakości obrazu.

source: Generates a list of tag names for the given image.
pl: Generuje listę nazw tagów dla danego obrazu.

source: Path to the image.
pl: Ścieżka do obrazu.

source: Probability threshold. Defaults to 0.3.
pl: Próg prawdopodobieństwa. Domyślnie 0,3.

source: A list of tag names assigned to the image.
pl: Lista nazw tagów przypisanych do obrazu.

source: Loads all images from a directory and preprocesses them into a Tensor (synchronously).
pl: Ładuje wszystkie obrazy z katalogu i wstępnie przetwarza je w Tensor (synchronicznie).

source: Path to the directory containing images.
pl: Ścieżka do katalogu zawierającego obrazy.

source: - List of image file paths - A concatenated torch.Tensor of preprocessed images
pl: - Lista ścieżek plików obrazów - Skonkatenowany torch.Tensor wstępnie przetworzonych obrazów

source: A concatenated torch.Tensor of preprocessed images
pl: Skonkatenowany torch.Tensor wstępnie przetworzonych obrazów

source: Processes each group to: - Find the most common tag - Optionally measure quality to pick best images - Perform file operation and assemble result data
pl: Przetwarza każdą grupę, aby: - znalezienia najczęściej występującego tagu - opcjonalnego pomiaru jakości w celu wybrania najlepszych obrazów - wykonania operacji na plikach i zebrania danych wynikowych

source: group_id => set of image paths
pl: group_id => zestaw ścieżek obrazów

source: A list of group records with info about images & best images
pl: Lista rekordów grup z informacjami o obrazach i najlepszych obrazach

source: Forward pass (synchronous) through the CLIP model for a single image, returning labels above a probability threshold.
pl: Przejście do przodu (synchroniczne) przez model CLIP dla pojedynczego obrazu, zwracające etykiety powyżej progu prawdopodobieństwa.

source: Path to the image file.
pl: Ścieżka do pliku obrazu.

source: List of text labels.
pl: Lista etykiet tekstowych.

source: Identifies duplicate images by cosine similarity of embeddings, synchronously.
pl: Identyfikuje zduplikowane obrazy na podstawie kosinusowego podobieństwa osadzeń, synchronicznie.

source: This method loads images from the specified directory, computes their embeddings using the CLIP model, and then calculates the cosine similarity between each pair of images. If the similarity exceeds the specified threshold, the pair is considered a duplicate.
pl: Ta metoda ładuje obrazy z określonego katalogu, oblicza ich osadzenia przy użyciu modelu CLIP, a następnie oblicza podobieństwo kosinusowe między każdą parą obrazów. Jeśli podobieństwo przekracza określony próg, para jest uznawana za duplikat.

source: Path to the folder containing images.
pl: Ścieżka do folderu zawierającego obrazy.

source: Threshold for considering images as duplicates, ranging from 0 to 1. Defaults to 0.9.
pl: Próg uznawania obrazów za duplikaty, w zakresie od 0 do 1. Domyślnie 0,9.

source: A list of tuples where each tuple contains two image paths and their similarity score.
pl: Lista krotek, gdzie każda krotka zawiera dwie ścieżki obrazu i ich wynik podobieństwa.

source: High-level method to group duplicates into subfolders, also handle non-duplicates. - Finds groups from duplicates - Processes each group (common tag, best images) - Places non-duplicate images in a 'non_duplicates' subfolder - Saves a JSON summary of everything
pl: Wysokopoziomowa metoda grupowania duplikatów w podfolderach, obsługująca również nie-duplikaty. - Znajduje grupy z duplikatów - Przetwarza każdą grupę (wspólny tag, najlepsze obrazy) - Umieszcza nie-duplikaty obrazów w podfolderze "non_duplicates" - Zapisuje podsumowanie JSON wszystkiego

source: (img1, img2, similarity).
pl: (img1, img2, podobieństwo).

source: Where grouped images will be placed.
pl: Gdzie będą umieszczane zgrupowane obrazy.

source: File operation. Defaults to "copy".
pl: Operacja na pliku. Domyślnie "kopiuj".

source: Whether to measure quality. Defaults to True.
pl: Czy mierzyć jakość. Domyślnie True.

source: If provided, separate out non-duplicates. Defaults to None.
pl: Jeśli podano, oddziela nieduplikaty. Domyślnie Brak.

source: Method to score the best images. Defaults to "advanced".
pl: Metoda oceny najlepszych obrazów. Domyślnie "zaawansowane".

source: Searches for images similar to a text query using the CLIP model.
pl: Wyszukuje obrazy podobne do zapytania tekstowego przy użyciu modelu CLIP.

source: The text query to search for.
pl: Zapytanie tekstowe do wyszukania.

source: Number of top similar images to return. Defaults to 5.
pl: Liczba najbardziej podobnych obrazów do zwrócenia. Domyślnie 5.

source: Path to save files what was found. Defaults to None.
pl: Ścieżka do zapisania znalezionych plików. Domyślnie Brak.

source: A list of tuples containing image file paths and their similarity scores.
pl: Lista krotek zawierająca ścieżki do plików graficznych i ich wyniki podobieństwa.

source: Generates tags for a given image using CLIP, optionally saves metadata.
pl: Generuje tagi dla danego obrazu za pomocą CLIP, opcjonalnie zapisuje metadane.

source: Path to save metadata. Defaults to None.
pl: Ścieżka do zapisania metadanych. Domyślnie Brak.

source: Number of top tags to return. Defaults to 5.
pl: Liczba najlepszych tagów do zwrócenia. Domyślnie 5.

source: A list of assigned tags (tag + probability).
pl: Lista przypisanych tagów (tag + prawdopodobieństwo).

source: Calculates the sharpness of a grayscale image using the variance of the Laplacian.
pl: Oblicza ostrość obrazu w skali szarości przy użyciu wariancji Laplaciana.

source: This function computes the Laplacian of the image and returns the variance, which is a measure of sharpness. Higher variance indicates a sharper image.
pl: Ta funkcja oblicza laplasjan obrazu i zwraca wariancję, która jest miarą ostrości. Wyższa wariancja oznacza ostrzejszy obraz.

source: Variance of the Laplacian, representing the image sharpness.
pl: Wariancja Laplaciana, reprezentująca ostrość obrazu.

source: Builds a dictionary grouping sets of duplicates. Each group has a numeric ID.
pl: Tworzy słownik grupujący zestawy duplikatów. Każda grupa ma numeryczny identyfikator.

source: A mapping from group_id => set of image paths
pl: Mapowanie z group_id => zestaw ścieżek obrazów

source: Loads an image from the specified path and converts it to a grayscale image.
pl: Wczytuje obraz z podanej ścieżki i konwertuje go na obraz w skali szarości.

source: This function uses OpenCV to read the image data from the file, decode it, and convert it to grayscale. If OpenCV is not available or the image cannot be loaded, it returns None.
pl: Ta funkcja używa OpenCV do odczytania danych obrazu z pliku, zdekodowania go i przekonwertowania na skalę szarości. Jeśli OpenCV nie jest dostępny lub nie można załadować obrazu, funkcja zwraca None.

source: Grayscale image array if successful, None otherwise.
pl: Tablica obrazów w skali szarości w przypadku powodzenia, brak w przeciwnym razie.

source: Naive 'sharpness' measure using the variance of the Laplacian on the entire image. Higher => sharper image.
pl: Naiwna miara "ostrości" wykorzystująca wariancję Laplaciana na całym obrazie. Wyższy => ostrzejszy obraz.

source: Variance of Laplacian (0 if error or if cv2 missing).
pl: Wariancja laplasjanu (0 w przypadku błędu lub braku cv2).

source: Utility functions for file operations, creating shortcuts (Windows), and saving metadata.
pl: Funkcje narzędziowe do operacji na plikach, tworzenia skrótów (Windows) i zapisywania metadanych.

source: Copies a file from src to dest, preserving metadata (timestamps, etc.).
pl: Kopiuje plik z src do dest, zachowując metadane (znaczniki czasu itp.).

source: Source file path.
pl: Ścieżka pliku źródłowego.

source: Destination file path.
pl: Ścieżka pliku docelowego.

source: Creates a directory if it does not exist.
pl: Tworzy katalog, jeśli nie istnieje.

source: Path to the directory.
pl: Ścieżka do katalogu.

source: Creates a Windows shortcut (.lnk) to the target file.
pl: Tworzy skrót Windows (.lnk) do pliku docelowego.

source: Absolute path to the target file.
pl: Ścieżka bezwzględna do pliku docelowego.

source: Absolute path where the shortcut will be created.
pl: Ścieżka bezwzględna, w której zostanie utworzony skrót.

source: Shortcut description. Defaults to None.
pl: Opis skrótu. Domyślnie Brak.

source: Path to an icon file. Defaults to None.
pl: Ścieżka do pliku ikony. Domyślnie Brak.

source: Returns a list of supported image file paths in the given directory. Supported extensions: png, jpg, jpeg, bmp, webp
pl: Zwraca listę obsługiwanych ścieżek plików graficznych w podanym katalogu. Obsługiwane rozszerzenia: png, jpg, jpeg, bmp, webp

source: Path to a folder containing images.
pl: Ścieżka do folderu zawierającego obrazy.

source: List of file paths found with supported extensions.
pl: Lista znalezionych ścieżek plików z obsługiwanymi rozszerzeniami.

source: Loads default values from an INI config file and returns them as a dictionary-like object.
pl: Wczytuje wartości domyślne z pliku konfiguracyjnego INI i zwraca je jako obiekt podobny do słownika.

source: The path to the config file. Defaults to "config.ini".
pl: Ścieżka do pliku konfiguracyjnego. Domyślnie "config.ini".

source: A config section (dict-like) with default values.
pl: Sekcja konfiguracji (podobna do dict) z wartościami domyślnymi.

source: Performs a file operation (copy or symlink/shortcut) from src to dest_dir.
pl: Wykonuje operację na pliku (kopiowanie lub dowiązanie symboliczne/skrót) z src do dest_dir.

source: Destination directory path.
pl: Ścieżka katalogu docelowego.

source: Type of operation ('copy', 'symlink', etc.).
pl: Typ operacji ("kopia", "dowiązanie symboliczne" itp.).

source: Used if creating a shortcut. Defaults to None.
pl: Używane podczas tworzenia skrótu. Domyślnie ustawiona na Brak.

source: Opens and preprocesses a single image using the provided CLIP preprocess pipeline.
pl: Otwiera i wstępnie przetwarza pojedynczy obraz przy użyciu dostarczonego potoku wstępnego przetwarzania CLIP.

source: The CLIP preprocess transform.
pl: Przekształcenie wstępne CLIP.

source: 'cpu' or 'cuda'.
pl: 'cpu' lub 'cuda'.

source: The preprocessed image on the appropriate device.z
pl: Wstępnie przetworzony obraz na odpowiednim urządzeniu.z

source: Saves metadata to a JSON file.
pl: Zapisuje metadane do pliku JSON.

source: Metadata to be saved.
pl: Metadane do zapisania.

source: Path to the output JSON file.
pl: Ścieżka do wyjściowego pliku JSON.

source: Custom logging formatter to add colors to log messages based on their severity level.
pl: Niestandardowy formatyzator logowania dodający kolory do komunikatów dziennika w oparciu o ich poziom ważności.

source: Format the specified record as text.
pl: Formatuje określony rekord jako tekst.

source: The log record to be formatted.
pl: Rekord dziennika do sformatowania.

source: The formatted log message with color.
pl: Sformatowany komunikat dziennika z kolorem.

source: Get a logger with the specified name.
pl: Pobiera rejestrator o podanej nazwie.

source: The name of the logger.
pl: Nazwa rejestratora.

source: The logger instance.
pl: Instancja rejestratora.

source: Generate example log messages of various severity levels.
pl: Generowanie przykładowych komunikatów dziennika o różnych poziomach ważności.
